#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.common.data.aci_tenant.common: Reading...
module.common.aci_tenant.github_project: Refreshing state... [id=uni/tn-github_project]
module.common.aci_vlan_pool.github_project: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static]
module.common.data.aci_tenant.common: Read complete after 0s [id=uni/tn-common]
module.common.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.common.aci_physical_domain.github_project: Refreshing state... [id=uni/phys-github_project]
module.common.aci_vrf.github_project: Refreshing state... [id=uni/tn-github_project/ctx-github_project]
module.common.aci_attachable_access_entity_profile.github_project: Refreshing state... [id=uni/infra/attentp-github_project]
module.common.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-github_project/gen-default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.git_net_1.aci_application_epg.github_project will be created
  + resource "aci_application_epg" "github_project" {
      + annotation                  = "tag_epg"
      + application_profile_dn      = (known after apply)
      + description                 = "EPG for git_net_1"
      + exception_tag               = "0"
      + flood_on_encap              = "disabled"
      + fwd_ctrl                    = (known after apply)
      + has_mcast_source            = "no"
      + id                          = (known after apply)
      + is_attr_based_epg           = "no"
      + match_t                     = "AtleastOne"
      + name                        = "git_net_1_epg"
      + name_alias                  = (known after apply)
      + pc_enf_pref                 = "unenforced"
      + pref_gr_memb                = "exclude"
      + prio                        = "unspecified"
      + relation_fv_rs_bd           = (known after apply)
      + relation_fv_rs_cust_qos_pol = (known after apply)
      + shutdown                    = "no"
    }

  # module.git_net_1.aci_application_profile.github_project will be created
  + resource "aci_application_profile" "github_project" {
      + annotation                = "orchestrator:terraform"
      + description               = "git_net_1 ap"
      + id                        = (known after apply)
      + name                      = "git_net_1_ap"
      + name_alias                = (known after apply)
      + prio                      = (known after apply)
      + relation_fv_rs_ap_mon_pol = (known after apply)
      + tenant_dn                 = "uni/tn-github_project"
    }

  # module.git_net_1.aci_bridge_domain.github_project will be created
  + resource "aci_bridge_domain" "github_project" {
      + annotation                  = "tag_bd"
      + arp_flood                   = "yes"
      + bridge_domain_type          = "regular"
      + description                 = "Bridge Domain for git_net_1"
      + ep_clear                    = "no"
      + ep_move_detect_mode         = (known after apply)
      + host_based_routing          = "no"
      + id                          = (known after apply)
      + intersite_bum_traffic_allow = "yes"
      + intersite_l2_stretch        = "yes"
      + ip_learning                 = "yes"
      + ipv6_mcast_allow            = (known after apply)
      + limit_ip_learn_to_subnets   = "yes"
      + ll_addr                     = (known after apply)
      + mac                         = (known after apply)
      + mcast_allow                 = "no"
      + multi_dst_pkt_act           = "bd-flood"
      + name                        = "vlan_15_bd"
      + name_alias                  = (known after apply)
      + optimize_wan_bandwidth      = "no"
      + relation_fv_rs_bd_to_ep_ret = (known after apply)
      + relation_fv_rs_bd_to_nd_p   = (known after apply)
      + relation_fv_rs_ctx          = "uni/tn-github_project/ctx-github_project"
      + relation_fv_rs_igmpsn       = (known after apply)
      + relation_fv_rs_mldsn        = (known after apply)
      + tenant_dn                   = "uni/tn-github_project"
      + unicast_route               = (known after apply)
      + unk_mac_ucast_act           = "proxy"
      + unk_mcast_act               = "flood"
      + v6unk_mcast_act             = (known after apply)
      + vmac                        = "not-applicable"
    }

  # module.git_net_1.aci_epg_to_domain.net_2_domain will be created
  + resource "aci_epg_to_domain" "net_2_domain" {
      + allow_micro_seg       = (known after apply)
      + annotation            = "orchestrator:terraform"
      + application_epg_dn    = (known after apply)
      + binding_type          = (known after apply)
      + custom_epg_name       = (known after apply)
      + delimiter             = (known after apply)
      + encap                 = (known after apply)
      + encap_mode            = (known after apply)
      + epg_cos               = (known after apply)
      + epg_cos_pref          = (known after apply)
      + id                    = (known after apply)
      + instr_imedcy          = (known after apply)
      + lag_policy_name       = (known after apply)
      + netflow_dir           = (known after apply)
      + netflow_pref          = (known after apply)
      + num_ports             = (known after apply)
      + port_allocation       = (known after apply)
      + primary_encap         = (known after apply)
      + primary_encap_inner   = (known after apply)
      + res_imedcy            = (known after apply)
      + secondary_encap_inner = (known after apply)
      + switching_mode        = (known after apply)
      + tdn                   = "uni/phys-github_project"
      + vmm_allow_promiscuous = (known after apply)
      + vmm_forged_transmits  = (known after apply)
      + vmm_id                = (known after apply)
      + vmm_mac_changes       = (known after apply)
    }

  # module.git_net_1.aci_epgs_using_function.epg_to_aep_assign will be created
  + resource "aci_epgs_using_function" "epg_to_aep_assign" {
      + access_generic_dn = "uni/infra/attentp-github_project/gen-default"
      + annotation        = "orchestrator:terraform"
      + encap             = "vlan-15"
      + id                = (known after apply)
      + instr_imedcy      = (known after apply)
      + mode              = "regular"
      + primary_encap     = (known after apply)
      + tdn               = (known after apply)
    }

  # module.git_net_1.aci_subnet.subnet will be created
  + resource "aci_subnet" "subnet" {
      + annotation  = "orchestrator:terraform"
      + ctrl        = (known after apply)
      + description = "This subnet is created by terraform"
      + id          = (known after apply)
      + ip          = "192.168.15.1/24"
      + name_alias  = (known after apply)
      + parent_dn   = (known after apply)
      + preferred   = "no"
      + scope       = [
          + "public",
          + "shared",
        ]
      + virtual     = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.tfplan"

```

</details>

*Pushed by: @kozhabergenova, Action: `pull_request`*